Documents/ЛБ_ПриказРежимРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПриказРежимРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГрафикРаботыЛомбардаПостоянный</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ГрафикРаботыЛомбардаВременный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПриказаРежимаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыПриказовРежимРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПерерыва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РежимРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПерерывНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПерерывОкончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выходной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезПерерыва</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЛБ_ВидыПриказаРежимаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПриказаРежимаРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ПриказРежимРаботы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1";
	КомандаПечати.Представление = НСтр("ru = 'Печать'");  

	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение1") Тогда  
		ПараметрыВывода.ЗаголовокФормы = СокрЛП(МассивОбъектов[0].Ссылка);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Приложение1",
			НСтр("ru = 'Печать'"),
			СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ЛБ_ПриказРежимРаботы.Приложение1");
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати)  
	
	Таб = Новый ТабличныйДокумент;

	Для каждого Док из МассивОбъектов Цикл
	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_ПриказРежимРаботы.Приложение1"); 
		
		Обл = Макет.ПолучитьОбласть("Шапка");
//		Обл.Параметры.Номер = Док.Номер; 
		Обл.Параметры.Дата  = Формат(Док.Дата, "ДЛФ=DD");
		Если Док.ВидПриказа = Перечисления.ЛБ_ВидыПриказаРежимаРаботы.Временный Тогда
			Обл.Параметры.УтвердитьРежим = "Утвердить режим работы с "+Формат(Док.ДатаНачала, "ДФ=dd.MM.yyyy")+" г. по "+Формат(Док.ДатаОкончания, "ДФ=dd.MM.yyyy")+" г."; 
		Иначе
			Обл.Параметры.УтвердитьРежим = "Утвердить режим работы с "+Формат(Док.ДатаНачала, "ДФ=dd.MM.yyyy")+" г."; 
		КонецЕсли;

		Отдел = СокрЛП(Док.Отделение.Наименование);
		РезультатСкл = ПолучитьСклоненияСтроки(Отдел, , "ПД=Родительный");
		Если РезультатСкл.Количество() > 0 Тогда
			Отдел = РезультатСкл[0];
		КонецЕсли; 			
		
		Обл.Параметры.ОрежимеРаботы = "О режиме работы "+Отдел+" отделения ломбардов";
		
		Таб.Вывести(Обл); 
		
		тзЛомб = Док.РежимРаботы.Выгрузить();
		тзЛомб.Свернуть("Ломбард"); 
		тзЛомб.Колонки.Добавить("НомерЧисловой");
		Для каждого стр из тзЛомб Цикл
			стр.НомерЧисловой = стр.Ломбард.НомерЧисловой;
		КонецЦикла;
		тзЛомб.Сортировать("НомерЧисловой");
		
				
		Для каждого стрЛомб из тзЛомб Цикл  
			отбор = Новый Структура("Ломбард", стрЛомб.Ломбард);
			Обл = Макет.ПолучитьОбласть("Строка");
			
			ЛомбардФактАдрес = "";
			ОтборК = Новый Структура;
			ОтборК.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес); 
			ОтборК.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресЛомбарда);
			СтрокиК = стрЛомб.Ломбард.КонтактнаяИнформация.НайтиСтроки(ОтборК);
			Если НЕ СтрокиК.Количество() = 0 Тогда 
	    		ЛомбардФактАдрес = СтрокиК.Получить(0).Представление;
			КонецЕсли;             				
			СтрокаЛомбарда = "Ломбард № "+СокрЛП(стрЛомб.Ломбард.НомерЛомбарда) + " ("+СокрЛП(ЛомбардФактАдрес)+")";							
			Обл.Параметры.Ломбард   = СтрокаЛомбарда;
			
			НайденныеСтроки = Док.РежимРаботы.НайтиСтроки(отбор);
			Для каждого стр из НайденныеСтроки Цикл
							
				Обл.Параметры["Начало"+СокрЛП(стр.НомерДня)] = Формат(стр.Начало, "ДФ=ЧЧ:мм"); 
				Обл.Параметры["Окончание"+СокрЛП(стр.НомерДня)] = Формат(стр.Окончание, "ДФ=ЧЧ:мм");
				
				Если стр.Выходной Тогда 
					Обл.Параметры["Начало"+СокрЛП(стр.НомерДня)] = "Вых"; 
					Обл.Параметры["Окончание"+СокрЛП(стр.НомерДня)] = "-";
				КонецЕсли;					
				
				Если стр.БезПерерыва Тогда
					Обл.Параметры["ПерерывНачало"+СокрЛП(стр.НомерДня)] = "Нет"; 
					Обл.Параметры["ПерерывОкончание"+СокрЛП(стр.НомерДня)] = "-"; 
				ИначеЕсли НЕ ЗначениеЗаполнено(стр.ПерерывНачало) Тогда 
					Обл.Параметры["ПерерывНачало"+СокрЛП(стр.НомерДня)] = "Нет"; 
					Обл.Параметры["ПерерывОкончание"+СокрЛП(стр.НомерДня)] = "-";					
				Иначе
					Обл.Параметры["ПерерывНачало"+СокрЛП(стр.НомерДня)] = Формат(стр.ПерерывНачало, "ДФ=ЧЧ:мм"); 
					Обл.Параметры["ПерерывОкончание"+СокрЛП(стр.НомерДня)] = Формат(стр.ПерерывОкончание, "ДФ=ЧЧ:мм");  
				КонецЕсли;
				
			КонецЦикла;	
				
			Таб.Вывести(Обл);
		КонецЦикла;  
		
		Обл = Макет.ПолучитьОбласть("Подвал"); 
				
		Директор = ЛБ_ОбщийМодуль.ПолучитьЗначениеДопНастройки("Директор");
		
		Если Док.Подписант = Директор тогда
			Обл.Параметры.ДолжностьПодписанта = "Директор";
		Иначе
			Обл.Параметры.ДолжностьПодписанта = "Первый заместитель директора"; 
		КонецЕсли;
		Обл.Параметры.Подписант = ВернутьФИОИнициалы(Док.Подписант);
		
		Таб.Вывести(Обл);

		
	КонецЦикла;   
	
	//
	Таб.НижнийКолонтитул.НачальнаяСтраница = 1;
	//Таб.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	Таб.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman", 7,, Истина);
	Таб.НижнийКолонтитул.ТекстСлева = СокрЛП(Текущаядата())+ " " +ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Док.ОтветственныйСотрудник));	
	Таб.НижнийКолонтитул.Выводить = Истина;

	
	
	Таб.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	Таб.ТолькоПросмотр = Истина; 
	Таб.ОтображатьСетку = Ложь; 
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;  
	Таб.ПолеСлева = 5;
	Таб.ПолеСправа = 5;
	Таб.АвтоМасштаб = Истина;

	Возврат Таб;

КонецФункции

Функция ВернутьФИОИнициалы(Подписант)
	Возврат СокрЛП(Подписант.Фамилия) + " " + СокрЛП(Подписант.Инициалы);
КонецФункции


#КонецОбласти

#КонецЕсли
